teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/VCOM/VCOMSys.c
/****************************************************************************
 * @file     VCOMSys.c
 * @version  V1.00
 * $Revision: 3 $
 * $Date: 8/07/12 2:01p $ 
 * @brief    NUC200 Series USB VOCM System API
 *
 * @note
 * Copyright (C) 2011 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <stdio.h>
#include <string.h>
#include "NUC200Series.h"
#include "VCOMSys.h"
#include "VCOM_API.h"

//#define DEBUG

#ifdef  DEBUG
# define DBG_PRINTF         printf
#else
# define DBG_PRINTF(...)  
#endif

#define Maximum(a,b)        ((a)>(b) ? (a) : (b))
#define Minimum(a,b)        ((a)<(b) ? (a) : (b))


/* Endpoint description */
S_USBD_EP_CTRL sEpDescription[] = 
{
    {CTRL_EP_NUM    | EP_INPUT,  VCOM_CTRL_MXPLD, NULL},
    {CTRL_EP_NUM    | EP_OUTPUT, VCOM_CTRL_MXPLD, NULL},
    {BULK_IN_EP_NUM | EP_INPUT,  BULK_EP_MXPLD, NULL},
    {BULK_OUT_EP_NUM| EP_OUTPUT, BULK_EP_MXPLD, NULL},
    {INT_IN_EP_NUM  | EP_INPUT,  INT_EP_MXPLD, NULL},
    {0,0,0}
};

/* Bus event call back functions */
S_USBD_EVENT_PROCESS g_sBusOps[6] = 
{
    {NULL, NULL},                               /* Attach event callback        */
    {NULL, NULL},                               /* Detach event callback        */
    {USBD_BusResetCallback, &gsVcomDevice},     /* Bus reset event callback     */
    {NULL, NULL},                               /* Bus suspend event callback   */
    {NULL, NULL},                               /* Bus resume event callback    */
    {USBD_CtrlSetupAck, &gsVcomDevice},         /* Setup event callback         */
};

/* USB event call back functions */
S_USBD_EVENT_PROCESS g_sUsbOps[12] = 
{
    {USBD_CtrlDataInAck, &gsVcomDevice},
    {USBD_CtrlDataOutAck, &gsVcomDevice},
    
    {VCOM_BulkInAckCallback, &gsVcomDevice},
    {NULL, NULL},

    {NULL, NULL},
    {VCOM_BulkOutAckCallback, &gsVcomDevice},

    {VCOM_IntInAckCallback, &gsVcomDevice},
    {NULL, NULL},
    
    {NULL, NULL},
    {NULL, NULL},
    
    {NULL, NULL},
    {NULL, NULL},
};


/* ctrl pipe call back.                                                                   */
/* it will be call by USBD_CtrlSetupAck, USBD_CtrlDataInAck and USBD_CtrlDataOutAck */
/* if in ack handler and out ack handler is 0, default handler will be called             */
S_USBD_CTRL_CALLBACK_ENTRY g_asCtrlCallbackEntry[] = {
    //request type,command     ,setup ack handler         , in ack handler      ,out ack handler,  parameter
    {REQ_STANDARD, SET_ADDRESS, USBD_CtrlSetupSetAddress, USBD_CtrlDataInSetAddress, 0, &gsVcomDevice},
    {REQ_STANDARD, CLEAR_FEATURE, USBD_CtrlSetupClearSetFeature, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, SET_FEATURE, USBD_CtrlSetupClearSetFeature, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, GET_CONFIGURATION, USBD_CtrlSetupGetConfiguration, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, GET_STATUS, USBD_CtrlSetupGetStatus, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, GET_INTERFACE, USBD_CtrlSetupGetInterface, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, SET_INTERFACE, USBD_CtrlSetupSetInterface, 0, 0, &gsVcomDevice},
    {REQ_STANDARD, GET_DESCRIPTOR, VCOM_CtrlSetupGetDescriptor, VCOM_CtrlDataInGetDescriptor, 0, &gsVcomDevice},
    {REQ_STANDARD, SET_CONFIGURATION, VCOM_CtrlSetupSetConfiguration, 0, 0, &gsVcomDevice},
    {REQ_CLASS, SET_LINE_CODE, VCOM_SetLineCoding, 0, VCOM_SetLineCodingDataOut, &gsVcomDevice},
    {REQ_CLASS, GET_LINE_CODE, VCOM_GetLineCoding, 0, 0, &gsVcomDevice}, 
    {REQ_CLASS, SET_CONTROL_LINE_STATE, VCOM_CtrlLineState, 0, 0, &gsVcomDevice}
};


S_VCOM_DEVICE gsVcomDevice;

//the structure registered to USB driver
S_USBD_CLASS sVcomClass = 
{
    (void*)&gsVcomDevice, 
    NULL,
    NULL
};


/* Line coding structure
  0-3 dwDTERate    Data terminal rate (baudrate), in bits per second
  4   bCharFormat  Stop bits: 0 - 1 Stop bit, 1 - 1.5 Stop bits, 2 - 2 Stop bits
  5   bParityType  Parity:    0 - None, 1 - Odd, 2 - Even, 3 - Mark, 4 - Space
  6   bDataBits    Data bits: 5, 6, 7, 8, 16  */

typedef struct { 
    uint32_t  u32DTERate;     /* Baud rate    */
    uint8_t   u8CharFormat;   /* stop bit     */
    uint8_t   u8ParityType;   /* parity       */
    uint8_t   u8DataBits;     /* data bits    */
} S_VCOM_LINE_CODING;


//S_VCOM_LINE_CODING gLineCoding = {0};
S_VCOM_LINE_CODING gLineCoding = {115200, 0, 0, 8};    /* Baud rate : 115200    */
                                                       /* Stop bit     */
                                                       /* parity       */
                                                       /* data bits    */
   
      

uint16_t gCtrlSignal = 0;     /* BIT0: DTR(Data Terminal Ready) , BIT1: RTS(Request To Send) */

/* To handle the data transfer size > maximum packet size */
static uint16_t gu16TransferLen = 0;
static uint16_t gu16PacketLen = 0;
static uint16_t gu16TransferIndex = 0;


/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_CtrlDataInGetDescriptor                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The USB get descriptor  data in event callback function.                                           */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_CtrlDataInGetDescriptor(void* pVoid)
{
    S_USBD_DEVICE *psDevice = &gsUsbDevice;
    
