teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/VCOM/VCOMSys.c
    if (psDevice->au8Setup[0] & 0x80)
    {
        if(gu16TransferLen)
        {
            if(gu16TransferLen >= gu16PacketLen)
            {       
                USBD_DataIn(0, gau8ConfigDescriptor + gu16TransferIndex, gu16PacketLen);
                gu16TransferLen -= gu16PacketLen;
                gu16TransferIndex += gu16PacketLen;
            }
            else
            {
                USBD_DataIn(0, gau8ConfigDescriptor + gu16TransferIndex, gu16TransferLen);
                gu16TransferLen = 0;
            }
            
            if (gu16TransferLen == 0)
                _USBD_TRIG_EP(1, 0x00); //Ctl data out
        }
        else
        {
            _USBD_TRIG_EP(1, 0x00);
        }
    }
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_CtrlSetupGetDescriptor                                                                   */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The USB get descriptor event callback function.                                                    */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_CtrlSetupGetDescriptor(void* pVoid)
{
    S_VCOM_DEVICE *psVcomDevice = (S_VCOM_DEVICE *)pVoid;
    S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)psVcomDevice->device;
    
    uint16_t u16Len, u16ConfigLen;
    
    u16Len = 0;
    u16Len = psDevice->au8Setup[7];
    u16Len <<= 8;
    u16Len += psDevice->au8Setup[6];

    switch (psDevice->au8Setup[3])
    {
        /* Get Device Descriptor */
        case DESC_DEVICE:
        {
            u16Len = Minimum(u16Len, LEN_DEVICE);

            USBD_DataIn(0, psVcomDevice->au8DeviceDescriptor, u16Len);
            break;
        }

        /* Get Configuration Descriptor */
        case DESC_CONFIG:
        {
            u16ConfigLen = psVcomDevice->au8ConfigDescriptor[3];
            u16ConfigLen <<= 8;
            u16ConfigLen |= psVcomDevice->au8ConfigDescriptor[2];

            gu16TransferLen = Minimum(u16Len, u16ConfigLen);
            gu16PacketLen = 64;
            gu16TransferIndex = 0;

            if(gu16TransferLen > gu16PacketLen)
            {
                USBD_DataIn(0, psVcomDevice->au8ConfigDescriptor + gu16TransferIndex, gu16PacketLen);
                gu16TransferLen -= gu16PacketLen;
                gu16TransferIndex += gu16PacketLen;
            }
            else
            {
                USBD_DataIn(0, psVcomDevice->au8ConfigDescriptor + gu16TransferIndex, gu16TransferLen);
                gu16TransferLen = 0;
            }
            break;
        }

        /* Get String Descriptor */
        case DESC_STRING:
        {
            /* Get Language */
            if (psDevice->au8Setup[2] == 0)
            {
                u16Len = Minimum(u16Len, 4);
                USBD_DataIn(0, gau8StringLang, u16Len);
            }
            else
            {
                /* Get String Descriptor */
                switch (psDevice->au8Setup[2])
                {
                    case 1:
                        u16Len = Minimum(u16Len, psVcomDevice->sVendorStringDescriptor[0]);
                
                        USBD_DataIn(0, (const uint8_t *)psVcomDevice->sProductStringDescriptor, u16Len);
                        break;
                    case 2:
                        u16Len = Minimum(u16Len, psVcomDevice->sProductStringDescriptor[0]);
                        USBD_DataIn(0, (const uint8_t *)psVcomDevice->sProductStringDescriptor, u16Len);
                        break;
                    case 3:
                        u16Len = Minimum(u16Len, gau8StringSerial[0]);
                        USBD_DataIn(0, gau8StringSerial, u16Len);
                        break;
                    default:
                        // Not support. Reply STALL.
                        USBD_ClrCtrlReadyAndTrigStall();
                }
            }
            break;
        }
        default:
            // Not support. Reply STALL.
            USBD_ClrCtrlReadyAndTrigStall();
    }
    
    return;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_SetLineCoding                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The callback function when get SET_LINE_CODING request.                                            */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_SetLineCoding(void* pVoid)
{
    S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)((S_VCOM_DEVICE *)pVoid)->device;
    DBG_PRINTF("Set line coding\n");
    psDevice->abData0[0] = FALSE;
    USBD_DataOutTrigger(0, 7);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_SetLineCodingDataOut                                                                     */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The callback function when get the out data of set line coding request.                            */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_SetLineCodingDataOut(void* pVoid)
{
    S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)((S_VCOM_DEVICE *)pVoid)->device;
    uint8_t *buf;
    uint32_t size;
    
