teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/VCOM/VCOMSys.c
    buf = USBD_GetOutData(0, &size);
    memcpy((void *)&gLineCoding, buf, size);
    
    /* ACK to end the transfer */
    psDevice->abData0[0] = FALSE;
    USBD_DataIn(0, 0, 0);

    DBG_PRINTF("Baudrate : %d\n", gLineCoding.u32DTERate);
    DBG_PRINTF("Stop bit : %s\n", (gLineCoding.u8CharFormat==2)?"2-bit":((gLineCoding.u8CharFormat)?"1.5-bit":"1-bit"));
    {
#ifdef  DEBUG
        char s[5][6] = {"None", "Odd", "Even", "Mark", "Space"};
#endif
        DBG_PRINTF("Parity   : %s\n", &s[gLineCoding.u8ParityType][0]);
    }
    DBG_PRINTF("Data bits: %d\n", gLineCoding.u8DataBits);
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_GetLineCoding                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The callback function when get GET_LINE_CODING request.                                            */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_GetLineCoding(void* pVoid)
{
    S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)((S_VCOM_DEVICE *)pVoid)->device;

    psDevice->abData0[0] = TRUE;
    USBD_DataIn(0, (void *)&gLineCoding, 7);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_CtrlLineState                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The callback function when get SET_CONTROL_LINE_STATE request.                                     */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_CtrlLineState(void* pVoid)
{
    S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)((S_VCOM_DEVICE *)pVoid)->device;
    
    gCtrlSignal = psDevice->au8Setup[3];
    gCtrlSignal = (gCtrlSignal << 8) | psDevice->au8Setup[2];
    
    USBD_DataIn(0, 0, 0); 
    
    DBG_PRINTF("RTS=%d  DTR=%d\n", (gCtrlSignal>>1)&1, gCtrlSignal&1);    
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_CtrlSetupSetConfiguration                                                                */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      pVoid - [in],   A pointer to USB class device structure (gsVcomDevice).                            */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      The callback function when get SET_CONFIGURATION request.                                          */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_CtrlSetupSetConfiguration(void* pVoid)
{
    S_USBD_DEVICE *pDrvDevice = &gsUsbDevice;
    S_USBD_CLASS *psUsbClass = pDrvDevice->psUsbClass;
    int32_t bIsDeviceConfigure;
    
    bIsDeviceConfigure = psUsbClass->pfnCompare ? psUsbClass->pfnCompare(pDrvDevice->au8Setup[2]) : 1;
    
    if (pDrvDevice->au8Setup[2] == 0)
    {
        // USB address state.
        USBD_SetUsbState(eUSBD_ADDRESS);
        pDrvDevice->u8UsbConfiguration = pDrvDevice->au8Setup[2];
        USBD_DataIn(0, NULL, 0);
        
    }
    else if(bIsDeviceConfigure)
    {
        // USB configured state.
        USBD_SetUsbState(eUSBD_CONFIGURED);

        // Call USB class's start function
        if(psUsbClass->pfnStart)
            psUsbClass->pfnStart(pVoid);

