teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/VCOM/VCOMSys.c
        pDrvDevice->u8UsbConfiguration = pDrvDevice->au8Setup[2];

        USBD_DataIn(0, NULL, 0);
        
        /* Reset bulk in/out endpoint */
        USBD_DataOutTrigger(BULK_OUT_EP_NUM, 64);
        USBD_DataIn(BULK_IN_EP_NUM, 0, 0);
    }
    else
    {
        // Not support. Reply STALL.
        USBD_ClrCtrlReadyAndTrigStall();
    }   
}



/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_Open                                                                                     */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      None                                                                                               */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      E_SUCCESS                                                                                          */
/*                                                                                                         */
/* Description:                                                                                            */
/*      To install the virtual com to USB device driver and install the relative descriptors.              */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
int32_t VCOM_Open(void)
{
    S_VCOM_DEVICE *psVcomDevice = &gsVcomDevice;
    
    /* Install the virtual com to USB device */
    psVcomDevice->device = (void*)USBD_InstallClassDevice(&sVcomClass);
    
    /* Configure the descritors */
    psVcomDevice->au8DeviceDescriptor = gau8DeviceDescriptor;
    psVcomDevice->au8ConfigDescriptor = gau8ConfigDescriptor;   
    psVcomDevice->sVendorStringDescriptor = gau8VendorStringDescriptor;
    psVcomDevice->sProductStringDescriptor = gau8ProductStringDescriptor;
    
    /* Install the USB event callbacks */
    USBD_InstallCtrlHandler(psVcomDevice->device, g_asCtrlCallbackEntry, 
        sizeof(g_asCtrlCallbackEntry) / sizeof(g_asCtrlCallbackEntry[0]));

    return E_SUCCESS;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: VCOM_Close                                                                                    */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*      None                                                                                               */
/*                                                                                                         */
/* Returns:                                                                                                */
/*      None                                                                                               */
/*                                                                                                         */
/* Description:                                                                                            */
/*      To close virtual com.                                                                              */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void VCOM_Close(void)
{

}

